In [1]:
import numpy as np
import pandas as pd
labels = ['a','b','c']
mydata = [10,20,30]
arr = np.array(mydata)
d = {'a':10, 'b':20, 'c': 30}
pd.Series (data = mydata)

0    10
1    20
2    30
dtype: int64

In [2]:
pd.Series (data = mydata, index = labels)

a    10
b    20
c    30
dtype: int64

In [3]:
pd.Series (arr)

0    10
1    20
2    30
dtype: int32

In [4]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series (data = labels)

0    a
1    b
2    c
dtype: object

In [6]:
ser1 = pd.Series ([1,2,3,4], ['USA', 'Russia', 'Germany', 'Japan'])

In [8]:
ser1

USA        1
Russia     2
Germany    3
Japan      4
dtype: int64

In [9]:
ser1 ['USA']

1

In [10]:
ser3 = pd.Series(data= labels)

In [11]:
ser3[1]

'b'

In [13]:
ser2 = pd.Series ([1,2,5,4], ['USA', 'Russia', 'Italy', 'Japan'])

In [14]:
ser1 + ser2

Germany    NaN
Italy      NaN
Japan      8.0
Russia     4.0
USA        2.0
dtype: float64

In [15]:
from numpy.random import randn
np.random.seed(101)

In [16]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df['new'] = "Hello"

In [37]:
df

          W         X         Y         Z    new
A  2.706850  0.628133  0.907969  0.503826  Hello
B  0.651118 -0.319318 -0.848077  0.605965  Hello
C -2.018168  0.740122  0.528813 -0.589001  Hello
D  0.188695 -0.758872 -0.933237  0.955057  Hello
E  0.190794  1.978757  2.605967  0.683509  Hello

In [41]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df['new'].drop

<bound method Series.drop of A    Hello
B    Hello
C    Hello
D    Hello
E    Hello
Name: new, dtype: object>

In [46]:
df.drop('new', axis = 1, inplace = True)

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df [2:][3:]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [55]:
df.loc['A','W']

2.706849839399938

In [56]:
df.iloc[1,1]

-0.31931804459303326

In [57]:
df.loc['B','Y']

-0.8480769834036315

In [58]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [59]:
df.iloc [1:,1:]

          X         Y         Z
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [60]:
np.random.seed(101)

In [65]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df[df['W'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [70]:
df [df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df.reset_index(inplace = True)

In [78]:
df.set_index('index', inplace = True)

In [79]:
df

              W         X         Y         Z
index
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
C     -2.018168  0.740122  0.528813 -0.589001
D      0.188695 -0.758872 -0.933237  0.955057
E      0.190794  1.978757  2.605967  0.683509

In [80]:
outside = ['g1','g1','g1','g2','g2','g2']

In [102]:
inside = [1,2,3,1,2,3]

In [103]:
hier_index = list(zip(outside, inside))

In [104]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [85]:
hier_index

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 1),
            ('g2', 2),
            ('g2', 1),
            ('g2', 2)],
           )

In [105]:
df1 = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [92]:
df1.loc['g1']

          A         B
1  0.188695 -0.758872
2 -0.933237  0.955057
1  0.190794  1.978757

In [93]:
df1.index.names

FrozenList([None, None])

In [108]:
df1.index.names = ['Groups', 'Num']

In [109]:
df1

                   A         B
Groups Num
g1     1   -0.134841  0.390528
       2    0.166905  0.184502
       3    0.807706  0.072960
g2     1    0.638787  0.329646
       2   -0.497104 -0.754070
       3   -0.943406  0.484752

In [98]:
df1.loc['g2'].loc[2]['B']

Num
2    0.683509
2   -1.159119
Name: B, dtype: float64

In [107]:
df1.loc['g1'].loc[1]['A']

-0.13484072060601238

In [110]:
df1.xs (1, level = 'Num')

               A         B
Groups
g1     -0.134841  0.390528
g2      0.638787  0.329646

In [111]:
d = {'a': [1,2,np.nan],
     'b': [5,np.nan, np.nan],
     'c': [1,2,3]}

In [114]:
dfNew = pd.DataFrame(d)

In [115]:
dfNew.dropna()

     a    b  c
0  1.0  5.0  1

In [116]:
dfNew

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [117]:
dfNew.dropna(thresh = 2)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [118]:
dfNew['a'].fillna(dfNew['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [121]:
dfRight = pd.DataFrame(np.random.rand(4,3), ['W','X','Y','Z'], ['A','B','C'])

In [122]:
dfRight

          A         B         C
W  0.651768  0.424569  0.656595
X  0.209161  0.659925  0.529623
Y  0.748520  0.093757  0.784522
Z  0.687242  0.695078  0.496867

In [143]:
dfLeft = pd.DataFrame([['US', 'United States', '1'],['RU', 'Russia', '4'],['JA', 'Japan', 3],['EN', 'England', '2']])
dfLeft.columns = ['Code','Country', 'Rank']
dfLeft['Index'] = ['W','X', 'Y','Z']

In [144]:
dfLeft

  Code        Country Rank Index
0   US  United States    1     W
1   RU         Russia    4     X
2   JA          Japan    3     Y
3   EN        England    2     Z

In [148]:
dfLeft.set_index ('Index', inplace = True)

In [149]:
dfLeft

      Code        Country Rank
Index
W       US  United States    1
X       RU         Russia    4
Y       JA          Japan    3
Z       EN        England    2

In [147]:
dfRight

          A         B         C
W  0.651768  0.424569  0.656595
X  0.209161  0.659925  0.529623
Y  0.748520  0.093757  0.784522
Z  0.687242  0.695078  0.496867

In [150]:
groupbyDict = {'Company':'GOOG GOOG MSFT MSFT FB FB'.split(),
               'Person' :'Sam Charlie Amy Vanessa Carl Sarah'.split(),
               'Sales'  : [200, 120, 340, 124, 243,350]}

In [151]:
gpbyDf = pd.DataFrame(groupbyDict)

In [152]:
gpbyDf

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [155]:
companygroupby = gpbyDf.groupby('Company')

In [156]:
companygroupby

In [162]:
companygroupby['Sales'].max().loc['FB']

350

In [165]:
companygroupby.describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [166]:
dfLeft

      Code        Country Rank
Index
W       US  United States    1
X       RU         Russia    4
Y       JA          Japan    3
Z       EN        England    2

In [186]:
dfRight

        Index         A         B         C
Level_0
0           W  0.651768  0.424569  0.656595
1           X  0.209161  0.659925  0.529623
2           Y  0.748520  0.093757  0.784522
3           Z  0.687242  0.695078  0.496867

In [171]:
pd.concat([dfRight,dfLeft],axis=1)

              A         B         C Code        Country Rank
Index
W      0.651768  0.424569  0.656595   US  United States    1
X      0.209161  0.659925  0.529623   RU         Russia    4
Y      0.748520  0.093757  0.784522   JA          Japan    3
Z      0.687242  0.695078  0.496867   EN        England    2

In [187]:
pd.merge(dfRight,dfLeft,how = "inner", on = "Index")

  Index         A         B         C Code        Country Rank
0     W  0.651768  0.424569  0.656595   US  United States    1
1     X  0.209161  0.659925  0.529623   RU         Russia    4
2     Y  0.748520  0.093757  0.784522   JA          Japan    3
3     Z  0.687242  0.695078  0.496867   EN        England    2

In [200]:
def sqrthis(num):
   return num ** 2
dfRight['A'].apply(sqrthis)

Level_0
0    0.424801
1    0.043749
2    0.560283
3    0.472302
Name: A, dtype: float64

In [201]:
dfRight.sort_values('A')

        Index         A         B         C
Level_0
1           X  0.209161  0.659925  0.529623
0           W  0.651768  0.424569  0.656595
3           Z  0.687242  0.695078  0.496867
2           Y  0.748520  0.093757  0.784522

In [202]:
gpbyDf

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [203]:
gpbyDf.pivot_table(values = 'Sales', index = ['Company'], columns = 'Person')

Person     Amy   Carl  Charlie    Sam  Sarah  Vanessa
Company
FB         NaN  243.0      NaN    NaN  350.0      NaN
GOOG       NaN    NaN    120.0  200.0    NaN      NaN
MSFT     340.0    NaN      NaN    NaN    NaN    124.0